#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Xiyak/terraform-test/runs/run-XPxAinupsnvZNnpM

Waiting for the plan to start...

Terraform v0.14.6
Configuring remote state backend...
Initializing Terraform configuration...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudfront_distribution.website_cdn will be created
  + resource "aws_cloudfront_distribution" "website_cdn" {
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + default_root_object            = "index.html"
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = true
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_100"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + custom_error_response {
          + error_caching_min_ttl = 3000
          + error_code            = 404
          + response_code         = 200
          + response_page_path    = "/index.html"
        }

      + default_cache_behavior {
          + allowed_methods        = [
              + "GET",
              + "HEAD",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
            ]
          + compress               = false
          + default_ttl            = 300
          + max_ttl                = 1200
          + min_ttl                = 0
          + target_origin_id       = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = false
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "none"
                  + whitelisted_names = (known after apply)
                }
            }
        }

      + origin {
          + domain_name = (known after apply)
          + origin_id   = (known after apply)

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1",
                  + "TLSv1.1",
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + cloudfront_default_certificate = true
          + minimum_protocol_version       = "TLSv1"
        }
    }

  # aws_cloudwatch_log_group.test will be created
  + resource "aws_cloudwatch_log_group" "test" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "us-east-1_fargate_log_group"
      + retention_in_days = 0
    }

  # aws_ecr_repository.test_ecr will be created
  + resource "aws_ecr_repository" "test_ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "us-east-1-test_ecr"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
    }

  # aws_ecs_cluster.test[0] will be created
  + resource "aws_ecs_cluster" "test" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "develop"
      + tags = {
          + "Name" = "develop_cluster"
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_cluster.test[1] will be created
  + resource "aws_ecs_cluster" "test" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "staging"
      + tags = {
          + "Name" = "staging_cluster"
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_ecs_cluster.test[2] will be created
  + resource "aws_ecs_cluster" "test" {
      + arn  = (known after apply)
      + id   = (known after apply)
      + name = "production"
      + tags = {
          + "Name" = "production_cluster"
        }

      + setting {
          + name  = (known after apply)
          + value = (known after apply)
        }
    }

  # aws_iam_role.fargate_role will be created
  + resource "aws_iam_role" "fargate_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "us-east-1_fargate_role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_s3_bucket.webapp will be created
  + resource "aws_s3_bucket" "webapp" {
      + acceleration_status         = (known after apply)
      + acl                         = "public-read"
      + arn                         = (known after apply)
      + bucket                      = "us-east-1-webapp-bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "us-east-1 Webapp Bucket"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "PUT",
              + "POST",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3000
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document = "404.html"
          + index_document = "index.html"
        }
    }

  # null_resource.fill-bucket will be created
  + resource "null_resource" "fill-bucket" {
      + id = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + nombre_ecr = "us-east-1-test_ecr"
```

</details>

*Pusher: @xiyak, Action: `pull_request`*